app/controllers/configs_controller.rb

    def show
      @user = Config.find_by(account_id:params["account_id"], account_mail:params["account_mail"])
      sum = Config.where(account_id:params['account_id']).size
---
SELECT COUNT(*) FROM "configs" WHERE "configs"."account_id" = $1  [["account_id", "testaccount01"]]
SELECT "configs".* FROM "configs" WHERE "configs"."account_id" = $1 AND "configs"."account_mail" = $2 LIMIT $3  [["account_id", "testaccount01"], ["account_mail", "testman@email.com"], ["LIMIT", 1]]