app/controllers/posts_controller.rb

    def index
      @posts = Post.all
      @maximum_id = Post.maximum(:id)
      @minimum_id = Post.minimum(:id)
---
SELECT "posts".* FROM "posts"
SELECT MIN("posts"."id") FROM "posts"
SELECT MAX("posts"."id") FROM "posts"

    def create
      #@post = Post.create(filename:params['filename'],account_id:params['account_id'],object_id:params['object_id'],
       # image:params['image'],extension:params['extension'],size:params['size'],volume:params['volume'],
       # x:params['x'],y:params['y'],z:params['z'],text:params['text'],
       # activation:params['activation'])                                                                      #Unityから投稿

      #@post = Post.new(permit_params)  ###ブラウザから投稿2024/2/23変更
      @post = Post.create(permit_params)  ###ブラウザから投稿2024/2/23変更

      if(@post.account_id.to_s != "" and @post.object_id.to_s != "" and @post.x.to_s != "" and @post.y.to_s != "" and @post.z.to_s != "" and @post.activation.to_s != "")
      if(@post.image.url.to_s != "")

        @post.size = @post.image.file.size
        #@post.extension = @post.image.file.extension  ###Unity上で動作

        if(@post.size.to_i < 20000000)
          @post.save!
---
INSERT INTO "posts" ("account_id", "image", "object_id", "filename", "extension", "size", "volume", "x", "y", "z", "text", "activation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
UPDATE "posts" SET "size" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["size", "1611026"], ["updated_at", "2024-02-23 13:44:35.887169"], ["id", 37]]

    def delete
      obj = Post.find_by(object_id:params["object_id"])
      if(obj.account_id == params['account_id'])
        obj.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."object_id" IS NULL LIMIT $1  [["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 22]]

    def delete_index
      obj = Post.find(params[:id])
      obj.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]

    def delete_all
      @maximum_id = Post.maximum(:id)
      @minimum_id = Post.minimum(:id)

      @data = Post.all
      @data.each do |obj|
---
SELECT "posts".* FROM "posts"
SELECT MAX("posts"."id") FROM "posts"
SELECT MIN("posts"."id") FROM "posts"